#include <bits/stdc++.h>
using namespace std;

#define endl '\n'
using ll = long long;
const int maxn = 1000010;

int l1, l2, kmp[maxn];
string s1, s2;

int main() {
	ios::sync_with_stdio(0), cin.tie(0), cout.tie(0);
	cin >> s1 >> s2;
	l1 = s1.size(), l2 = s2.size();
	int j = 0;
	for (int i = 1; i < l2; i++) {
		j = kmp[i - 1];
		while (j > 0 && s2[i] != s2[j]) //匹配失败，就继续往回跳，直到可以继续匹配
			j = kmp[j - 1];
		if (s2[i] == s2[j]) //匹配成功，则前缀长度 j+1
			j++;
		kmp[i] = j;
	}
	j = 0;
	for (int i = 0; i < l1; i++) {
		while (j > 0 && s1[i] != s2[j]) //匹配失败，就继续往回跳，直到可以继续匹配
			j = kmp[j - 1]; //
		if (s1[i] == s2[j]) //当前字符匹配成功，s2往右移动一位
			j++;
		if (j == l2) { //s2全部匹配成功，输出答案，并往回跳到上一个位置
			cout << i - l2 + 1 << endl;
			j = kmp[j - 1]; // 回退，继续寻找下一处匹配（支持重叠匹配）
		}
	}
	for (int i = 0; i < l2; i++)
		cout << kmp[i] << " ";
	return 0;
}

/*
暴力匹配字符串就是逐字符匹配，然后如果匹配失败就重新从s2的开头继续匹配，但容易被极端数据造成时间复杂度为O(l1 * l2)。

所以考虑进行优化，在匹配失败时不回到s2开头，而是回到s2前面的某个位置pos（并且s2[0...(pos - 1)]仍然与s1的前面那段匹配）。
假设当前已经匹配成功s2[0...(j - 1)]，但s1[i] != s2[j]，此时有s1, s2末尾的一段相同，此时如果要跳回到前面所说的那个位置pos，
那么这个位置必须与之前的那两段相同才可以直接跳过s2[0...(pos - 1)]的逐字符匹配，
也就是s2[0...(pos - 1)] = s2[(j - pos), (j - 1)] = s1[(i - pos), (i - 1)]，然后继续将s1[i]与s2[pos]进行匹配。

为了找到这个位置pos，需要定义一个kmp数组。首先有真前缀/后缀表示不包含整个字符串本身的前缀/后缀。
任何定义kmp[i]为模式串s2[0..i]的最长[真前缀 == 真后缀]的长度。那么此时kmp[j - 1]对应的就是之前已匹配的串s2[0...(j - 1)]，
那么它就是我们所需要的pos，因为此时有s2[0...(kmp[j - 1] - 1)] = s2[(j - kmp[j - 1]), (j - 1)]。然后让j = kmp[j - 1] (= pos)，
也就是往回跳，然后继续比较s1[i],s2[j]，如果再不成功就继续往回跳......以此类推
*/


